{
  "pt": {
    "headers": [
      "Guilherme&nbsp;Henrique Estevão&nbsp;Cunha",
      "Habilidades",
      "Python",
      "JavaScript",
      "HTML",
      "CSS",
      "Projetos",
      "Clique na imagem para acessar a página do projeto.",
      "Exercícios da Trybe",
      "Trybewarts",
      "Carta Misteriosa",
      "Adivinhe a Cor",
      "Gerador de Memes",
      "Lista de Tarefas",
      "Arte com Pixels",
      "Playground Functions",
      "Lições Aprendidas"
    ],
    "toc": [
      "Início",
      "Habilidades",
      "Python",
      "JavaScript",
      "HTML",
      "CSS",
      "Projetos",
      "Exercícios da Trybe",
      "Trybewarts",
      "Carta Misteriosa",
      "Adivinhe a Cor",
      "Gerador de Memes",
      "Lista de Tarefas",
      "Arte com Pixels",
      "Playground Functions",
      "Lições Aprendidas"
    ],
    "content": [
      "Olá, eu me chamo <strong>Guilherme</strong>! Atualmente tenho 19 anos e moro em <em>Nova Iguaçu</em>, no estado do <em>Rio de Janeiro</em>. Sempre tive uma certa paixão pela programação e, através do meu repertório sempre crescente de habilidades, sou capaz de fazer diversos tipos de trabalho.",
      "Python foi a primeira linguagem que eu aprendi, e já tenho uma grande familiaridade com ela. Sei muitos dos métodos e funções de cór, e os que não sei, consigo achar com algumas pesquisas rápidas.",
      "No JavaScript, em comparação ao Python, sou um pouco mais amador, mas as aulas da Trybe com certeza me farão ser tão bom nele quanto em Python, ou até melhor. A sua variedade de usos também significa que eu não poderia perder esse 'canivete' das linguagens.",
      "HTML também é um conhecimento recente para mim, mas eu já conheço bastante dele. Sou capaz de criar páginas básicas e médias, fazendo uso de tags semânticas para facilitar a leitura por métodos alternativos.",
      "Mesmo que recente, acredito que meu conhecimento sobre CSS seja bem alto. Estou acostumado a usar Grid e Flex, e sei de muitos modos de conseguir uma aparência desejada. No entanto, meu senso de estética não é tão bom...",
      "Esses exercícios, feitos no decorrer do curso da Trybe, serviram para praticar as várias habilidades que foram adquiridas por mim. Inclui muitos exemplos de HTML, CSS, JavaScript, e irá incluir muito mais com o tempo.",
      "Essa é uma página baseada na fantástica escola de magia Trybewarts, uma paródia da franquia <cite>Harry Potter</cite> criada por J.K. Rowling. A página contém um grande formulário e possui algumas funções de JavaScript de cunho mais avançado.",
      "Essa é uma página feita para simular uma carta misteriosa, que comummente é feita a partir de recortes de jornais e revistas. O usuário insere um texto na página, e a página exibe uma carta misteriosa com esse texto.",
      "Esse é um pequeno jogo no qual uma cor é dada no formato rgb e o jogador deve clicar no círculo que contém a cor correta, ganhando ou perdendo pontos conforme vai jogando.",
      "Essa é uma página feita para permitir que o usuário crie memes. É possível escolher uma imagem (dentre algumas pré-selecionadas ou fazendo upload de uma) e digitar um texto que aparece em cima, além de escolher bordas para a imagem.",
      "Essa é uma página feita para disponibilizar ao usuário um lugar para anotar suas tarefas, com recursos simples como editar tarefas, mudar a ordem delas e marcá-las como finalizadas.",
      "O primeiro projeto que integra o HTML/CSS com JavaScript, com o intuito de possibilitar que o usuário faça desenhos simples em pixels, com uma pequena variedade de cores e algumas configurações disponíveis.",
      "Esse foi um projeto feito exclusivamente com JavaScript, pensado para testar as minhas habilidades no mesmo, fazendo várias funções simples que seguem as especificações dadas. A página web que interpreta os comandos foi feita posteriormente.",
      "Esse foi o meu primeiro projeto feito na Trybe, e exibe minhas habilidades básicas de HTML e CSS, sem fazer uso de opções mais avançadas como Flex/Grid ou HTML semântico."
    ],
    "icons": {
      "html5": "Este projeto utiliza HTML.",
      "css3-alt": "Este projeto utiliza CSS.",
      "js": "Este projeto utiliza JavaScript.",
      "trybe": "Este é um projeto da Trybe.",
      "user": "Este é um projeto pessoal."
    }
  },
  "en": {
    "headers": [
      null,
      "Skills",
      null,
      null,
      null,
      null,
      "Projects",
      "Click on the image to access the project page.",
      "Trybe Exercises",
      null,
      "Mystery Letter",
      "Color Guess",
      "Meme Generator",
      "To-do List",
      "Pixels Art",
      null,
      "Lessons Learned"
    ],
    "toc": [
      "Start",
      "Skills",
      null,
      null,
      null,
      null,
      "Projects",
      "Trybe Exercises",
      null,
      "Mystery Letter",
      "Color Guess",
      "Meme Generator",
      "To-do List",
      "Pixels Art",
      null,
      "Lessons Learned"
    ],
    "content": [
      "Hello, my name is <strong>Guilherme</strong>! Currently, I'm 19 years old and I live in <em>Nova Iguaçu</em>, in the <em>Rio de Janeiro</em> state. I've always had a passion for programming and, through my evergrowing list of capabilities, I'm able to do many kinds of work.",
      "Python was the first language I've learned, and I'm very familiar with it. I know most of the methods and functions, and I can find the ones I don't with just a few quick searches.",
      "In JavaScript, unlike with Python, I'm more of an amateur, but my studies at Trybe will surely make me as good at it as in Python, or even better. Its variety of uses also means I couldn't miss this multipurpose tool.",
      "HTML is also a new development for me, but I already know a fair amount about it. I'm able to make simple and moderately complicated pages, making use of semantic tags to simplify reading through alternative methods.",
      "Though recent, I believe my knowledge about CSS is fairly large. I'm used to use Grid and Flex, and I know many ways of getting to the appearance I desire. However, my sense of aesthetic isn't all that good...",
      "These exercises, made during the Trybe course, were designed to practice the diverse skills I have acquired. There are many examples of HTML, CSS, JavaScript, and there'll be much more in the future.",
      "This is a page based on the Trybewarts school of wizardry, a parody of the <cite>Harry Potter</cite> franchise created by J.K. Rowling. The page contains a big form and has some more advanced JavaScript functions.",
      "This is a page made to simulate a mystery letter, which is commonly made from newspaper/magazine cutouts. The user inserts some text in the page, and it displays a mystery letter with that text.",
      "This is a small game in which a color is given in rgb format and the player must click on the circle that contains the correct color, getting or losing points as they play.",
      "This is a page made to allow for the user to create memes. It's possible to choose an image (from a pre-selected group or by uploading one) and type some text that will appear on top, as well as choosing a border for the image.",
      "This is a page made to give the user a place to write down their tasks, with simple features such as editing tasks, changing their order and marking them as finished.",
      "The first project that integrates HTML/CSS with JavaScript, with the objective of allowing for the user to make simple pixel drawings, with a small variety of colors and some available settings.",
      "This was a project made exclusively with JavaScript, in order to test my abilities in it, making various simple functions that follow the given specifications. The webpage that interpretes the commands was made afterwards.",
      "This was the first project I made at Trybe, and it displays my basic HTML and CSS skills, not making use of more advanced options like Flex/Grid or semantic HTML."
    ],
    "icons": {
      "html5": "This project uses HTML.",
      "css3-alt": "This project uses CSS.",
      "js": "This project uses JavaScript.",
      "trybe": "This is a Trybe project.",
      "user": "This is a personal project."
    }
  }
}