[
  {
    "id": "python",
    "name": "Python",
    "text": {
      "pt_BR": "Python foi a primeira linguagem que eu aprendi, e já tenho uma grande familiaridade com ela. Sei muitos dos métodos e funções de cór, e os que não sei, consigo achar com algumas pesquisas rápidas.",
      "en_US": "Python was the first language I've learned, and I'm very familiar with it. I know most of the methods and functions, and I can find the ones I don't with just a few quick searches."
    }
  },
  {
    "id": "js",
    "name": "JavaScript",
    "text": {
      "pt_BR": "No JavaScript, em comparação ao Python, sou um pouco mais amador, mas as aulas da Trybe com certeza me farão ser tão bom nele quanto em Python, ou até melhor. A sua variedade de usos também significa que eu não poderia perder esse 'canivete' das linguagens.",
      "en_US": "In JavaScript, unlike with Python, I'm more of an amateur, but my studies at Trybe will surely make me as good at it as in Python, or even better. Its variety of uses also means I couldn't miss this multipurpose tool."
    }
  },
  {
    "id": "html",
    "name": "HTML",
    "text": {
      "pt_BR": "HTML também é um conhecimento recente para mim, mas eu já conheço bastante dele. Sou capaz de criar páginas básicas e médias, fazendo uso de tags semânticas para facilitar a leitura por métodos alternativos.",
      "en_US": "HTML is also a new development for me, but I already know a fair amount about it. I'm able to make simple and moderately complicated pages, making use of semantic tags to simplify reading through alternative methods."
    }
  },
  {
    "id": "css",
    "name": "CSS",
    "text": {
      "pt_BR": "Mesmo que recente, acredito que meu conhecimento sobre CSS seja bem alto. Estou acostumado a usar Grid e Flex, e sei de muitos modos de conseguir uma aparência desejada. No entanto, meu senso de estética não é tão bom...",
      "en_US": "Though recent, I believe my knowledge about CSS is fairly large. I'm used to use Grid and Flex, and I know many ways of getting to the appearance I desire. However, my sense of aesthetic isn't all that good..."
    }
  }
]